{{- if eq .chezmoi.os "darwin" -}}
# Brewfile - Homebrew dependencies managed by chezmoi
# This file will be automatically installed when the Brewfile changes

# Core tools
brew "chezmoi"
brew "curl"
brew "direnv"
brew "git"
brew "glow"
brew "mas"  # Mac App Store command line interface
brew "tidy-viewer"  # CSV pretty printer (alias: tv)
brew "uv"
brew "vim"
brew "wget"

# Casks (GUI applications)
cask "docker"
cask "iterm2"
cask "obsidian"

# Mac App Store apps
mas "Perplexity", id: 6714467650
mas "Telegram", id: 747648890
{{- end -}}